// 大区，省份，城市数据
export default [
    {
        'id': 1,
        'name': '华北',
        'children': [{
            'id': 1,
            'name': '北京市',
            'children': [
                {
                    'id': 2,
                    'name': '市辖区'
                },
                {
                    'id': 17,
                    'name': '县'
                }
            ]
        },
        {
            'id': 20,
            'name': '天津市',
            'children': [
                {
                    'id': 21,
                    'name': '市辖区'
                },
                {
                    'id': 35,
                    'name': '县'
                }
            ]
        },
        {
            'id': 39,
            'name': '河北省',
            'children': [
                {
                    'id': 40,
                    'name': '石家庄市'
                },
                {
                    'id': 64,
                    'name': '唐山市'
                },
                {
                    'id': 80,
                    'name': '秦皇岛市'
                },
                {
                    'id': 89,
                    'name': '邯郸市'
                },
                {
                    'id': 110,
                    'name': '邢台市'
                },
                {
                    'id': 131,
                    'name': '保定市'
                },
                {
                    'id': 158,
                    'name': '张家口市'
                },
                {
                    'id': 177,
                    'name': '承德市'
                },
                {
                    'id': 190,
                    'name': '沧州市'
                },
                {
                    'id': 208,
                    'name': '廊坊市'
                },
                {
                    'id': 220,
                    'name': '衡水市'
                }
            ]
        },
        {
            'id': 233,
            'name': '山西省',
            'children': [
                {
                    'id': 234,
                    'name': '太原市'
                },
                {
                    'id': 246,
                    'name': '大同市'
                },
                {
                    'id': 259,
                    'name': '阳泉市'
                },
                {
                    'id': 266,
                    'name': '长治市'
                },
                {
                    'id': 281,
                    'name': '晋城市'
                },
                {
                    'id': 289,
                    'name': '朔州市'
                },
                {
                    'id': 297,
                    'name': '晋中市'
                },
                {
                    'id': 310,
                    'name': '运城市'
                },
                {
                    'id': 325,
                    'name': '忻州市'
                },
                {
                    'id': 341,
                    'name': '临汾市'
                },
                {
                    'id': 360,
                    'name': '吕梁市'
                }
            ]
        },
        {
            'id': 375,
            'name': '内蒙古自治区',
            'children': [
                {
                    'id': 376,
                    'name': '呼和浩特市'
                },
                {
                    'id': 387,
                    'name': '包头市'
                },
                {
                    'id': 398,
                    'name': '乌海市'
                },
                {
                    'id': 403,
                    'name': '赤峰市'
                },
                {
                    'id': 417,
                    'name': '通辽市'
                },
                {
                    'id': 427,
                    'name': '鄂尔多斯市'
                },
                {
                    'id': 437,
                    'name': '呼伦贝尔市'
                },
                {
                    'id': 453,
                    'name': '巴彦淖尔市'
                },
                {
                    'id': 462,
                    'name': '乌兰察布市'
                },
                {
                    'id': 475,
                    'name': '兴安盟'
                },
                {
                    'id': 482,
                    'name': '锡林郭勒盟'
                },
                {
                    'id': 495,
                    'name': '阿拉善盟'
                }
            ]
        }]
    },
    {
        'id': 2,
        'name': '东北',
        'children': [
            {
                'id': 499,
                'name': '辽宁省',
                'children': [
                    {
                        'id': 500,
                        'name': '沈阳市'
                    },
                    {
                        'id': 515,
                        'name': '大连市'
                    },
                    {
                        'id': 527,
                        'name': '鞍山市'
                    },
                    {
                        'id': 536,
                        'name': '抚顺市'
                    },
                    {
                        'id': 545,
                        'name': '本溪市'
                    },
                    {
                        'id': 553,
                        'name': '丹东市'
                    },
                    {
                        'id': 561,
                        'name': '锦州市'
                    },
                    {
                        'id': 570,
                        'name': '营口市'
                    },
                    {
                        'id': 578,
                        'name': '阜新市'
                    },
                    {
                        'id': 587,
                        'name': '辽阳市'
                    },
                    {
                        'id': 596,
                        'name': '盘锦市'
                    },
                    {
                        'id': 602,
                        'name': '铁岭市'
                    },
                    {
                        'id': 611,
                        'name': '朝阳市'
                    },
                    {
                        'id': 620,
                        'name': '葫芦岛市'
                    }
                ]
            },
            {
                'id': 628,
                'name': '吉林省',
                'children': [
                    {
                        'id': 629,
                        'name': '长春市'
                    },
                    {
                        'id': 641,
                        'name': '吉林市'
                    },
                    {
                        'id': 652,
                        'name': '四平市'
                    },
                    {
                        'id': 660,
                        'name': '辽源市'
                    },
                    {
                        'id': 666,
                        'name': '通化市'
                    },
                    {
                        'id': 675,
                        'name': '白山市'
                    },
                    {
                        'id': 683,
                        'name': '松原市'
                    },
                    {
                        'id': 690,
                        'name': '白城市'
                    },
                    {
                        'id': 697,
                        'name': '延边朝鲜族自治州'
                    }
                ]
            },
            {
                'id': 706,
                'name': '黑龙江省',
                'children': [
                    {
                        'id': 707,
                        'name': '哈尔滨市'
                    },
                    {
                        'id': 727,
                        'name': '齐齐哈尔市'
                    },
                    {
                        'id': 745,
                        'name': '鸡西市'
                    },
                    {
                        'id': 756,
                        'name': '鹤岗市'
                    },
                    {
                        'id': 766,
                        'name': '双鸭山市'
                    },
                    {
                        'id': 776,
                        'name': '大庆市'
                    },
                    {
                        'id': 787,
                        'name': '伊春市'
                    },
                    {
                        'id': 806,
                        'name': '佳木斯市'
                    },
                    {
                        'id': 818,
                        'name': '七台河市'
                    },
                    {
                        'id': 824,
                        'name': '牡丹江市'
                    },
                    {
                        'id': 836,
                        'name': '黑河市'
                    },
                    {
                        'id': 844,
                        'name': '绥化市'
                    },
                    {
                        'id': 856,
                        'name': '大兴安岭地区'
                    }
                ]
            }]
    },
    {
        'id': 3,
        'name': '华东',
        'children': [
            {
                'id': 860,
                'name': '上海市',
                'children': [
                    {
                        'id': 861,
                        'name': '市辖区'
                    },
                    {
                        'id': 878,
                        'name': '县'
                    }
                ]
            },
            {
                'id': 880,
                'name': '江苏省',
                'children': [
                    {
                        'id': 881,
                        'name': '南京市'
                    },
                    {
                        'id': 894,
                        'name': '无锡市'
                    },
                    {
                        'id': 904,
                        'name': '徐州市'
                    },
                    {
                        'id': 916,
                        'name': '常州市'
                    },
                    {
                        'id': 925,
                        'name': '苏州市'
                    },
                    {
                        'id': 936,
                        'name': '南通市'
                    },
                    {
                        'id': 946,
                        'name': '连云港市'
                    },
                    {
                        'id': 954,
                        'name': '淮安市'
                    },
                    {
                        'id': 964,
                        'name': '盐城市'
                    },
                    {
                        'id': 975,
                        'name': '扬州市'
                    },
                    {
                        'id': 983,
                        'name': '镇江市'
                    },
                    {
                        'id': 991,
                        'name': '泰州市'
                    },
                    {
                        'id': 999,
                        'name': '宿迁市'
                    }
                ]
            },
            {
                'id': 1006,
                'name': '浙江省',
                'children': [
                    {
                        'id': 1007,
                        'name': '杭州市'
                    },
                    {
                        'id': 1022,
                        'name': '宁波市'
                    },
                    {
                        'id': 1035,
                        'name': '温州市'
                    },
                    {
                        'id': 1048,
                        'name': '嘉兴市'
                    },
                    {
                        'id': 1057,
                        'name': '湖州市'
                    },
                    {
                        'id': 1064,
                        'name': '绍兴市'
                    },
                    {
                        'id': 1072,
                        'name': '金华市'
                    },
                    {
                        'id': 1083,
                        'name': '衢州市'
                    },
                    {
                        'id': 1091,
                        'name': '舟山市'
                    },
                    {
                        'id': 1097,
                        'name': '台州市'
                    },
                    {
                        'id': 1108,
                        'name': '丽水市'
                    }
                ]
            },
            {
                'id': 1119,
                'name': '安徽省',
                'children': [
                    {
                        'id': 1120,
                        'name': '合肥市'
                    },
                    {
                        'id': 1131,
                        'name': '芜湖市'
                    },
                    {
                        'id': 1141,
                        'name': '蚌埠市'
                    },
                    {
                        'id': 1150,
                        'name': '淮南市'
                    },
                    {
                        'id': 1158,
                        'name': '马鞍山市'
                    },
                    {
                        'id': 1166,
                        'name': '淮北市'
                    },
                    {
                        'id': 1172,
                        'name': '铜陵市'
                    },
                    {
                        'id': 1178,
                        'name': '安庆市'
                    },
                    {
                        'id': 1191,
                        'name': '黄山市'
                    },
                    {
                        'id': 1200,
                        'name': '滁州市'
                    },
                    {
                        'id': 1210,
                        'name': '阜阳市'
                    },
                    {
                        'id': 1220,
                        'name': '宿州市'
                    },
                    {
                        'id': 1227,
                        'name': '六安市'
                    },
                    {
                        'id': 1236,
                        'name': '亳州市'
                    },
                    {
                        'id': 1242,
                        'name': '池州市'
                    },
                    {
                        'id': 1248,
                        'name': '宣城市'
                    }
                ]
            },
            {
                'id': 1257,
                'name': '福建省',
                'children': [
                    {
                        'id': 1258,
                        'name': '福州市'
                    },
                    {
                        'id': 1273,
                        'name': '厦门市'
                    },
                    {
                        'id': 1281,
                        'name': '莆田市'
                    },
                    {
                        'id': 1288,
                        'name': '三明市'
                    },
                    {
                        'id': 1302,
                        'name': '泉州市'
                    },
                    {
                        'id': 1316,
                        'name': '漳州市'
                    },
                    {
                        'id': 1329,
                        'name': '南平市'
                    },
                    {
                        'id': 1341,
                        'name': '龙岩市'
                    },
                    {
                        'id': 1350,
                        'name': '宁德市'
                    }
                ]
            },
            {
                'id': 1361,
                'name': '江西省',
                'children': [
                    {
                        'id': 1362,
                        'name': '南昌市'
                    },
                    {
                        'id': 1373,
                        'name': '景德镇市'
                    },
                    {
                        'id': 1379,
                        'name': '萍乡市'
                    },
                    {
                        'id': 1386,
                        'name': '九江市'
                    },
                    {
                        'id': 1401,
                        'name': '新余市'
                    },
                    {
                        'id': 1405,
                        'name': '鹰潭市'
                    },
                    {
                        'id': 1410,
                        'name': '赣州市'
                    },
                    {
                        'id': 1430,
                        'name': '吉安市'
                    },
                    {
                        'id': 1445,
                        'name': '宜春市'
                    },
                    {
                        'id': 1457,
                        'name': '抚州市'
                    },
                    {
                        'id': 1470,
                        'name': '上饶市'
                    }
                ]
            },
            {
                'id': 1484,
                'name': '山东省',
                'children': [
                    {
                        'id': 1485,
                        'name': '济南市'
                    },
                    {
                        'id': 1497,
                        'name': '青岛市'
                    },
                    {
                        'id': 1509,
                        'name': '淄博市'
                    },
                    {
                        'id': 1519,
                        'name': '枣庄市'
                    },
                    {
                        'id': 1527,
                        'name': '东营市'
                    },
                    {
                        'id': 1534,
                        'name': '烟台市'
                    },
                    {
                        'id': 1548,
                        'name': '潍坊市'
                    },
                    {
                        'id': 1562,
                        'name': '济宁市'
                    },
                    {
                        'id': 1575,
                        'name': '泰安市'
                    },
                    {
                        'id': 1583,
                        'name': '威海市'
                    },
                    {
                        'id': 1589,
                        'name': '日照市'
                    },
                    {
                        'id': 1595,
                        'name': '莱芜市'
                    },
                    {
                        'id': 1599,
                        'name': '临沂市'
                    },
                    {
                        'id': 1613,
                        'name': '德州市'
                    },
                    {
                        'id': 1626,
                        'name': '聊城市'
                    },
                    {
                        'id': 1636,
                        'name': '滨州市'
                    },
                    {
                        'id': 1645,
                        'name': '菏泽市'
                    }
                ]
            },
            {
                'id': 3510,
                'name': '台湾省',
                'children': []
            }
        ]
    },
    {
        'id': 4,
        'name': '华中',
        'children': [
            {
                'id': 1656,
                'name': '河南省',
                'children': [
                    {
                        'id': 1657,
                        'name': '郑州市'
                    },
                    {
                        'id': 1671,
                        'name': '开封市'
                    },
                    {
                        'id': 1683,
                        'name': '洛阳市'
                    },
                    {
                        'id': 1700,
                        'name': '平顶山市'
                    },
                    {
                        'id': 1712,
                        'name': '安阳市'
                    },
                    {
                        'id': 1723,
                        'name': '鹤壁市'
                    },
                    {
                        'id': 1730,
                        'name': '新乡市'
                    },
                    {
                        'id': 1744,
                        'name': '焦作市'
                    },
                    {
                        'id': 1756,
                        'name': '濮阳市'
                    },
                    {
                        'id': 1764,
                        'name': '许昌市'
                    },
                    {
                        'id': 1772,
                        'name': '漯河市'
                    },
                    {
                        'id': 1779,
                        'name': '三门峡市'
                    },
                    {
                        'id': 1787,
                        'name': '南阳市'
                    },
                    {
                        'id': 1802,
                        'name': '商丘市'
                    },
                    {
                        'id': 1813,
                        'name': '信阳市'
                    },
                    {
                        'id': 1825,
                        'name': '周口市'
                    },
                    {
                        'id': 1837,
                        'name': '驻马店市'
                    },
                    {
                        'id': 1849,
                        'name': '省直辖县级行政区划'
                    }
                ]
            },
            {
                'id': 1851,
                'name': '湖北省',
                'children': [
                    {
                        'id': 1852,
                        'name': '武汉市'
                    },
                    {
                        'id': 1867,
                        'name': '黄石市'
                    },
                    {
                        'id': 1875,
                        'name': '十堰市'
                    },
                    {
                        'id': 1885,
                        'name': '宜昌市'
                    },
                    {
                        'id': 1900,
                        'name': '襄阳市'
                    },
                    {
                        'id': 1911,
                        'name': '鄂州市'
                    },
                    {
                        'id': 1916,
                        'name': '荆门市'
                    },
                    {
                        'id': 1923,
                        'name': '孝感市'
                    },
                    {
                        'id': 1932,
                        'name': '荆州市'
                    },
                    {
                        'id': 1942,
                        'name': '黄冈市'
                    },
                    {
                        'id': 1954,
                        'name': '咸宁市'
                    },
                    {
                        'id': 1962,
                        'name': '随州市'
                    },
                    {
                        'id': 1967,
                        'name': '恩施土家族苗族自治州'
                    },
                    {
                        'id': 1976,
                        'name': '省直辖县级行政区划'
                    }
                ]
            },
            {
                'id': 1981,
                'name': '湖南省',
                'children': [
                    {
                        'id': 1982,
                        'name': '长沙市'
                    },
                    {
                        'id': 1993,
                        'name': '株洲市'
                    },
                    {
                        'id': 2004,
                        'name': '湘潭市'
                    },
                    {
                        'id': 2011,
                        'name': '衡阳市'
                    },
                    {
                        'id': 2025,
                        'name': '邵阳市'
                    },
                    {
                        'id': 2039,
                        'name': '岳阳市'
                    },
                    {
                        'id': 2050,
                        'name': '常德市'
                    },
                    {
                        'id': 2061,
                        'name': '张家界市'
                    },
                    {
                        'id': 2067,
                        'name': '益阳市'
                    },
                    {
                        'id': 2075,
                        'name': '郴州市'
                    },
                    {
                        'id': 2088,
                        'name': '永州市'
                    },
                    {
                        'id': 2101,
                        'name': '怀化市'
                    },
                    {
                        'id': 2115,
                        'name': '娄底市'
                    },
                    {
                        'id': 2122,
                        'name': '湘西土家族苗族自治州'
                    }
                ]
            }]
    },
    {
        'id': 5,
        'name': '华南',
        'children': [
            {
                'id': 2131,
                'name': '广东省',
                'children': [
                    {
                        'id': 2132,
                        'name': '广州市'
                    },
                    {
                        'id': 2146,
                        'name': '韶关市'
                    },
                    {
                        'id': 2158,
                        'name': '深圳市'
                    },
                    {
                        'id': 2166,
                        'name': '珠海市'
                    },
                    {
                        'id': 2171,
                        'name': '汕头市'
                    },
                    {
                        'id': 2180,
                        'name': '佛山市'
                    },
                    {
                        'id': 2187,
                        'name': '江门市'
                    },
                    {
                        'id': 2196,
                        'name': '湛江市'
                    },
                    {
                        'id': 2207,
                        'name': '茂名市'
                    },
                    {
                        'id': 2214,
                        'name': '肇庆市'
                    },
                    {
                        'id': 2224,
                        'name': '惠州市'
                    },
                    {
                        'id': 2231,
                        'name': '梅州市'
                    },
                    {
                        'id': 2241,
                        'name': '汕尾市'
                    },
                    {
                        'id': 2247,
                        'name': '河源市'
                    },
                    {
                        'id': 2255,
                        'name': '阳江市'
                    },
                    {
                        'id': 2261,
                        'name': '清远市'
                    },
                    {
                        'id': 2271,
                        'name': '东莞市',
                        'children': []
                    },
                    {
                        'id': 2272,
                        'name': '中山市',
                        'children': []
                    },
                    {
                        'id': 2273,
                        'name': '潮州市'
                    },
                    {
                        'id': 2278,
                        'name': '揭阳市'
                    },
                    {
                        'id': 2285,
                        'name': '云浮市'
                    }
                ]
            },
            {
                'id': 2292,
                'name': '广西壮族自治区',
                'children': [
                    {
                        'id': 2293,
                        'name': '南宁市'
                    },
                    {
                        'id': 2307,
                        'name': '柳州市'
                    },
                    {
                        'id': 2319,
                        'name': '桂林市'
                    },
                    {
                        'id': 2338,
                        'name': '梧州市'
                    },
                    {
                        'id': 2347,
                        'name': '北海市'
                    },
                    {
                        'id': 2353,
                        'name': '防城港市'
                    },
                    {
                        'id': 2359,
                        'name': '钦州市'
                    },
                    {
                        'id': 2365,
                        'name': '贵港市'
                    },
                    {
                        'id': 2372,
                        'name': '玉林市'
                    },
                    {
                        'id': 2381,
                        'name': '百色市'
                    },
                    {
                        'id': 2395,
                        'name': '贺州市'
                    },
                    {
                        'id': 2401,
                        'name': '河池市'
                    },
                    {
                        'id': 2414,
                        'name': '来宾市'
                    },
                    {
                        'id': 2422,
                        'name': '崇左市'
                    }
                ]
            },
            {
                'id': 2431,
                'name': '海南省',
                'children': [
                    {
                        'id': 2432,
                        'name': '海口市'
                    },
                    {
                        'id': 2438,
                        'name': '三亚市'
                    },
                    {
                        'id': 2444,
                        'name': '三沙市',
                        'children': []
                    },
                    {
                        'id': 2445,
                        'name': '省直辖县级行政区划'
                    }
                ]
            },
            {
                'id': 3511,
                'name': '香港特别行政区',
                'children': []
            },
            {
                'id': 3512,
                'name': '澳门特别行政区',
                'children': []
            }
        ]
    },
    {
        'id': 6,
        'name': '西南',
        'children': [
            {
                'id': 2462,
                'name': '重庆市',
                'children': [
                    {
                        'id': 2463,
                        'name': '市辖区'
                    },
                    {
                        'id': 2485,
                        'name': '县'
                    }
                ]
            },
            {
                'id': 2503,
                'name': '四川省',
                'children': [
                    {
                        'id': 2504,
                        'name': '成都市'
                    },
                    {
                        'id': 2525,
                        'name': '自贡市'
                    },
                    {
                        'id': 2533,
                        'name': '攀枝花市'
                    },
                    {
                        'id': 2540,
                        'name': '泸州市'
                    },
                    {
                        'id': 2549,
                        'name': '德阳市'
                    },
                    {
                        'id': 2557,
                        'name': '绵阳市'
                    },
                    {
                        'id': 2568,
                        'name': '广元市'
                    },
                    {
                        'id': 2577,
                        'name': '遂宁市'
                    },
                    {
                        'id': 2584,
                        'name': '内江市'
                    },
                    {
                        'id': 2591,
                        'name': '乐山市'
                    },
                    {
                        'id': 2604,
                        'name': '南充市'
                    },
                    {
                        'id': 2615,
                        'name': '眉山市'
                    },
                    {
                        'id': 2623,
                        'name': '宜宾市'
                    },
                    {
                        'id': 2635,
                        'name': '广安市'
                    },
                    {
                        'id': 2643,
                        'name': '达州市'
                    },
                    {
                        'id': 2652,
                        'name': '雅安市'
                    },
                    {
                        'id': 2662,
                        'name': '巴中市'
                    },
                    {
                        'id': 2669,
                        'name': '资阳市'
                    },
                    {
                        'id': 2675,
                        'name': '阿坝藏族羌族自治州'
                    },
                    {
                        'id': 2689,
                        'name': '甘孜藏族自治州'
                    },
                    {
                        'id': 2708,
                        'name': '凉山彝族自治州'
                    }
                ]
            },
            {
                'id': 2726,
                'name': '贵州省',
                'children': [
                    {
                        'id': 2727,
                        'name': '贵阳市'
                    },
                    {
                        'id': 2739,
                        'name': '六盘水市'
                    },
                    {
                        'id': 2744,
                        'name': '遵义市'
                    },
                    {
                        'id': 2760,
                        'name': '安顺市'
                    },
                    {
                        'id': 2768,
                        'name': '毕节市'
                    },
                    {
                        'id': 2778,
                        'name': '铜仁市'
                    },
                    {
                        'id': 2790,
                        'name': '黔西南布依族苗族自治州'
                    },
                    {
                        'id': 2799,
                        'name': '黔东南苗族侗族自治州'
                    },
                    {
                        'id': 2816,
                        'name': '黔南布依族苗族自治州'
                    }
                ]
            },
            {
                'id': 2829,
                'name': '云南省',
                'children': [
                    {
                        'id': 2830,
                        'name': '昆明市'
                    },
                    {
                        'id': 2846,
                        'name': '曲靖市'
                    },
                    {
                        'id': 2857,
                        'name': '玉溪市'
                    },
                    {
                        'id': 2868,
                        'name': '保山市'
                    },
                    {
                        'id': 2875,
                        'name': '昭通市'
                    },
                    {
                        'id': 2888,
                        'name': '丽江市'
                    },
                    {
                        'id': 2895,
                        'name': '普洱市'
                    },
                    {
                        'id': 2907,
                        'name': '临沧市'
                    },
                    {
                        'id': 2917,
                        'name': '楚雄彝族自治州'
                    },
                    {
                        'id': 2928,
                        'name': '红河哈尼族彝族自治州'
                    },
                    {
                        'id': 2942,
                        'name': '文山壮族苗族自治州'
                    },
                    {
                        'id': 2951,
                        'name': '西双版纳傣族自治州'
                    },
                    {
                        'id': 2955,
                        'name': '大理白族自治州'
                    },
                    {
                        'id': 2968,
                        'name': '德宏傣族景颇族自治州'
                    },
                    {
                        'id': 2974,
                        'name': '怒江傈僳族自治州'
                    },
                    {
                        'id': 2979,
                        'name': '迪庆藏族自治州'
                    }
                ]
            },
            {
                'id': 2983,
                'name': '西藏自治区',
                'children': [
                    {
                        'id': 2984,
                        'name': '拉萨市'
                    },
                    {
                        'id': 2994,
                        'name': '日喀则市'
                    },
                    {
                        'id': 3013,
                        'name': '昌都地区'
                    },
                    {
                        'id': 3025,
                        'name': '山南地区'
                    },
                    {
                        'id': 3038,
                        'name': '那曲地区'
                    },
                    {
                        'id': 3050,
                        'name': '阿里地区'
                    },
                    {
                        'id': 3058,
                        'name': '林芝地区'
                    }
                ]
            }]
    },
    {
        'id': 7,
        'name': '西北',
        'children': [
            {
                'id': 3066,
                'name': '陕西省',
                'children': [
                    {
                        'id': 3067,
                        'name': '西安市'
                    },
                    {
                        'id': 3082,
                        'name': '铜川市'
                    },
                    {
                        'id': 3088,
                        'name': '宝鸡市'
                    },
                    {
                        'id': 3102,
                        'name': '咸阳市'
                    },
                    {
                        'id': 3118,
                        'name': '渭南市'
                    },
                    {
                        'id': 3131,
                        'name': '延安市'
                    },
                    {
                        'id': 3146,
                        'name': '汉中市'
                    },
                    {
                        'id': 3159,
                        'name': '榆林市'
                    },
                    {
                        'id': 3173,
                        'name': '安康市'
                    },
                    {
                        'id': 3185,
                        'name': '商洛市'
                    }
                ]
            },
            {
                'id': 3194,
                'name': '甘肃省',
                'children': [
                    {
                        'id': 3195,
                        'name': '兰州市'
                    },
                    {
                        'id': 3205,
                        'name': '嘉峪关市'
                    },
                    {
                        'id': 3207,
                        'name': '金昌市'
                    },
                    {
                        'id': 3211,
                        'name': '白银市'
                    },
                    {
                        'id': 3218,
                        'name': '天水市'
                    },
                    {
                        'id': 3227,
                        'name': '武威市'
                    },
                    {
                        'id': 3233,
                        'name': '张掖市'
                    },
                    {
                        'id': 3241,
                        'name': '平凉市'
                    },
                    {
                        'id': 3250,
                        'name': '酒泉市'
                    },
                    {
                        'id': 3259,
                        'name': '庆阳市'
                    },
                    {
                        'id': 3269,
                        'name': '定西市'
                    },
                    {
                        'id': 3278,
                        'name': '陇南市'
                    },
                    {
                        'id': 3289,
                        'name': '临夏回族自治州'
                    },
                    {
                        'id': 3298,
                        'name': '甘南藏族自治州'
                    }
                ]
            },
            {
                'id': 3307,
                'name': '青海省',
                'children': [
                    {
                        'id': 3308,
                        'name': '西宁市'
                    },
                    {
                        'id': 3317,
                        'name': '海东市'
                    },
                    {
                        'id': 3324,
                        'name': '海北藏族自治州'
                    },
                    {
                        'id': 3329,
                        'name': '黄南藏族自治州'
                    },
                    {
                        'id': 3334,
                        'name': '海南藏族自治州'
                    },
                    {
                        'id': 3340,
                        'name': '果洛藏族自治州'
                    },
                    {
                        'id': 3347,
                        'name': '玉树藏族自治州'
                    },
                    {
                        'id': 3354,
                        'name': '海西蒙古族藏族自治州'
                    }
                ]
            },
            {
                'id': 3360,
                'name': '宁夏回族自治区',
                'children': [
                    {
                        'id': 3361,
                        'name': '银川市'
                    },
                    {
                        'id': 3369,
                        'name': '石嘴山市'
                    },
                    {
                        'id': 3374,
                        'name': '吴忠市'
                    },
                    {
                        'id': 3381,
                        'name': '固原市'
                    },
                    {
                        'id': 3388,
                        'name': '中卫市'
                    }
                ]
            },
            {
                'id': 3393,
                'name': '新疆维吾尔自治区',
                'children': [
                    {
                        'id': 3394,
                        'name': '乌鲁木齐市'
                    },
                    {
                        'id': 3404,
                        'name': '克拉玛依市'
                    },
                    {
                        'id': 3410,
                        'name': '吐鲁番地区'
                    },
                    {
                        'id': 3414,
                        'name': '哈密地区'
                    },
                    {
                        'id': 3418,
                        'name': '昌吉回族自治州'
                    },
                    {
                        'id': 3426,
                        'name': '博尔塔拉蒙古自治州'
                    },
                    {
                        'id': 3431,
                        'name': '巴音郭楞蒙古自治州'
                    },
                    {
                        'id': 3441,
                        'name': '阿克苏地区'
                    },
                    {
                        'id': 3451,
                        'name': '克孜勒苏柯尔克孜自治州'
                    },
                    {
                        'id': 3456,
                        'name': '喀什地区'
                    },
                    {
                        'id': 3469,
                        'name': '和田地区'
                    },
                    {
                        'id': 3478,
                        'name': '伊犁哈萨克自治州'
                    },
                    {
                        'id': 3489,
                        'name': '塔城地区'
                    },
                    {
                        'id': 3497,
                        'name': '阿勒泰地区'
                    },
                    {
                        'id': 3505,
                        'name': '自治区直辖县级行政区划'
                    }
                ]
            }]
    }
]
