// 省份列表
export default [
    {
        'id': 1,
        'area': 1,
        'name': '北京市'
    },
    {
        'id': 20,
        'area': 1,
        'name': '天津市'
    },
    {
        'id': 39,
        'area': 1,
        'name': '河北省'
    },
    {
        'id': 233,
        'area': 1,
        'name': '山西省'
    },
    {
        'id': 375,
        'area': 1,
        'name': '内蒙古自治区'
    },
    {
        'id': 499,
        'area': 2,
        'name': '辽宁省'
    },
    {
        'id': 628,
        'area': 2,
        'name': '吉林省'
    },
    {
        'id': 706,
        'area': 2,
        'name': '黑龙江省'
    },
    {
        'id': 860,
        'area': 3,
        'name': '上海市'
    },
    {
        'id': 880,
        'area': 3,
        'name': '江苏省'
    },
    {
        'id': 1006,
        'area': 3,
        'name': '浙江省'
    },
    {
        'id': 1119,
        'area': 3,
        'name': '安徽省'
    },
    {
        'id': 1257,
        'area': 3,
        'name': '福建省'
    },
    {
        'id': 1361,
        'area': 3,
        'name': '江西省'
    },
    {
        'id': 1484,
        'area': 3,
        'name': '山东省'
    },
    {
        'id': 1656,
        'area': 4,
        'name': '河南省'
    },
    {
        'id': 1851,
        'area': 4,
        'name': '湖北省'
    },
    {
        'id': 1981,
        'area': 4,
        'name': '湖南省'
    },
    {
        'id': 2131,
        'area': 5,
        'name': '广东省'
    },
    {
        'id': 2292,
        'area': 5,
        'name': '广西壮族自治区'
    },
    {
        'id': 2431,
        'area': 5,
        'name': '海南省'
    },
    {
        'id': 2462,
        'area': 6,
        'name': '重庆市'
    },
    {
        'id': 2503,
        'area': 6,
        'name': '四川省'
    },
    {
        'id': 2726,
        'area': 6,
        'name': '贵州省'
    },
    {
        'id': 2829,
        'area': 6,
        'name': '云南省'
    },
    {
        'id': 2983,
        'area': 6,
        'name': '西藏自治区'
    },
    {
        'id': 3066,
        'area': 7,
        'name': '陕西省'
    },
    {
        'id': 3194,
        'area': 7,
        'name': '甘肃省'
    },
    {
        'id': 3307,
        'area': 7,
        'name': '青海省'
    },
    {
        'id': 3360,
        'area': 7,
        'name': '宁夏回族自治区'
    },
    {
        'id': 3393,
        'area': 7,
        'name': '新疆维吾尔自治区'
    },
    {
        'id': 3510,
        'area': 0,
        'name': '台湾省'
    },
    {
        'id': 3511,
        'area': 0,
        'name': '香港特别行政区'
    },
    {
        'id': 3512,
        'area': 0,
        'name': '澳门特别行政区'
    }
]
