// 大区，省份数据
export default [
    {
        'id': 1,
        'name': '华北',
        'children': [
            {
                'id': 1,
                'name': '北京市'
            },
            {
                'id': 20,
                'name': '天津市'
            },
            {
                'id': 39,
                'name': '河北省'
            },
            {
                'id': 233,
                'name': '山西省'
            },
            {
                'id': 375,
                'name': '内蒙古自治区'
            }
        ]
    },
    {
        'id': 2,
        'name': '东北',
        'children': [
            {
                'id': 499,
                'name': '辽宁省'
            },
            {
                'id': 628,
                'name': '吉林省'
            },
            {
                'id': 706,
                'name': '黑龙江省'
            }
        ]
    },
    {
        'id': 3,
        'name': '华东',
        'children': [
            {
                'id': 860,
                'name': '上海市'
            },
            {
                'id': 880,
                'name': '江苏省'
            },
            {
                'id': 1006,
                'name': '浙江省'
            },
            {
                'id': 1119,
                'name': '安徽省'
            },
            {
                'id': 1257,
                'name': '福建省'
            },
            {
                'id': 1361,
                'name': '江西省'
            },
            {
                'id': 1484,
                'name': '山东省'
            }
        ]
    },
    {
        'id': 4,
        'name': '华中',
        'children': [
            {
                'id': 1656,
                'name': '河南省'
            },
            {
                'id': 1851,
                'name': '湖北省'
            },
            {
                'id': 1981,
                'name': '湖南省'
            }
        ]
    },
    {
        'id': 5,
        'name': '华南',
        'children': [
            {
                'id': 2131,
                'name': '广东省'
            },
            {
                'id': 2292,
                'name': '广西壮族自治区'
            },
            {
                'id': 2431,
                'name': '海南省'
            }
        ]
    },
    {
        'id': 6,
        'name': '西南',
        'children': [
            {
                'id': 2462,
                'name': '重庆市'
            },
            {
                'id': 2503,
                'name': '四川省'
            },
            {
                'id': 2726,
                'name': '贵州省'
            },
            {
                'id': 2829,
                'name': '云南省'
            },
            {
                'id': 2983,
                'name': '西藏自治区'
            }
        ]
    },
    {
        'id': 7,
        'name': '西北',
        'children': [
            {
                'id': 3066,
                'name': '陕西省'
            },
            {
                'id': 3194,
                'name': '甘肃省'
            },
            {
                'id': 3307,
                'name': '青海省'
            },
            {
                'id': 3360,
                'name': '宁夏回族自治区'
            },
            {
                'id': 3393,
                'name': '新疆维吾尔自治区'
            }
        ]
    },
    {
        'id': 0,
        'name': '其他',
        'children': [
            {
                'id': 3510,
                'name': '台湾省'
            },
            {
                'id': 3511,
                'name': '香港特别行政区'
            },
            {
                'id': 3512,
                'name': '澳门特别行政区'
            }
        ]
    }
]
